tests/test_case/periodic_hills/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*    | =========                 |                                                 |
    | \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
    |  \    /   O peration     | Version:  2.3.0                                 |
    |   \  /    A nd           | Web:      www.OpenFOAM.org                      |
    |    \/     M anipulation  |                                                 |
    \*---------------------------------------------------------------------------*/
    FoamFile
    {
        version     2.0;
        format      ascii;
        class       dictionary;
        location    "constant";
        object      turbulenceProperties;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    simulationType RAS;

    RAS
    {
    RASModel        kOmegaSSTFS;

        turbulence      on;

        printCoeffs     on;

        kOmegaSSTFSCoeffs
        {
            a2          0.086;
            b2          0.064;
            betaStar2   0.079;
	    coeff1	0.07;
	    coeff2      0.079;
	    coeff3      0.063;
            coeff4      0.075;
            coeff5      0.072;
        }
    }

    // ************************************************************************* //
