tests/test_case/periodic_hills/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
14751
(
(8.95455 3.034 0.05)
(8.86364 3.034 0.05)
(8.77273 3.034 0.05)
(8.68182 3.034 0.05)
(8.59091 3.034 0.05)
(8.5 3.034 0.05)
(8.40909 3.034 0.05)
(8.31818 3.034 0.05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
99
(
(0.0454545 1 0.05)
(0.136364 0.998118 0.05)
(0.227273 0.988262 0.05)
(0.318182 0.962758 0.05)
(0.409091 0.917699 0.05)
(0.5 0.855829 0.05)
(0.590909 0.783428 0.05)
(0.681818 0.70647 0.05)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
99
(
(8.95455 3.036 0.05)
(8.86364 3.036 0.05)
(8.77273 3.036 0.05)
(8.68182 3.036 0.05)
(8.59091 3.036 0.05)
(8.5 3.036 0.05)
(8.40909 3.036 0.05)
(8.31818 3.036 0.05)
...
)
;
    }
}


// ************************************************************************* //
