tests/test_case/periodic_hills/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;
    }
}


// ************************************************************************* //
