tests/test_case/periodic_hills/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
14751
(
(0 0 0 -7.00031 0 0 0 0 0)
(-4.33821e-17 0 0 -7.00044 0 0 0 0 0)
(6.418e-17 0 0 -7.0001 0 0 -9.95215e-24 0 0)
(-3.36896e-17 0 0 -6.99983 0 0 9.95177e-24 0 0)
(2.74291e-17 0 0 -6.99962 0 0 -1.9903e-23 0 0)
(-1.40114e-17 0 0 -6.99946 0 0 3.38342e-22 0 0)
(1.19255e-17 0 0 -6.99927 0 0 0 0 0)
(-2.06448e-17 0 0 -6.99918 0 0 -4.97542e-24 0 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
99
(
(-9.31629e-17 0 0 28.0002 0 0 0 0 0)
(1.15929 0 0 27.9936 0 0 -2.08337e-17 0 0)
(4.84655 0 0 27.6314 0 0 -2.19736e-19 0 0)
(10.1201 0 0 26.2382 0 0 3.81607e-20 0 0)
(14.6114 0 0 24.1278 0 0 -4.23537e-19 0 0)
(16.9977 0 0 22.4969 0 0 2.68489e-16 0 0)
(18.0729 0 0 21.5853 0 0 2.57304e-16 0 0)
(18.2678 0 0 21.3463 0 0 0 0 0)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
99
(
(0 0 0 -14.0006 0 0 0 0 0)
(-4.33821e-17 0 0 -14.0009 0 0 0 0 0)
(6.418e-17 0 0 -14.0002 0 0 -9.95215e-24 0 0)
(-3.36896e-17 0 0 -13.9996 0 0 9.95177e-24 0 0)
(2.74291e-17 0 0 -13.9992 0 0 -1.9903e-23 0 0)
(-1.40114e-17 0 0 -13.9989 0 0 3.38342e-22 0 0)
(1.19255e-17 0 0 -13.9985 0 0 0 0 0)
(-2.06448e-17 0 0 -13.9984 0 0 -4.97542e-24 0 0)
...
)
;
    }
}


// ************************************************************************* //
