tests/test_case/periodic_hills/0/grad(k)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      grad(k);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   nonuniform List<vector> 
14751
(
(0 0 0)
(-1.5045e-22 2.84361e-21 0)
(1.994e-22 2.84347e-21 -2.1326e-29)
(-2.22897e-24 0 2.13252e-29)
(-4.03616e-23 2.84328e-21 -4.26492e-29)
(4.2519e-23 0 7.25019e-28)
(-6.55867e-23 0 0)
(-1.92563e-23 0 -1.06616e-29)
...
)
;

boundaryField
{
    bottomWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
99
(
(-1.77694e-22 0 0)
(5.76485e-23 -2.38738e-24 -4.46436e-23)
(-6.79904e-22 1.19255e-22 3.52606e-22)
(0 0 8.17729e-26)
(1.30241e-38 2.15067e-38 1.23232e-21)
(1.45371e-21 -1.09836e-21 -5.7454e-22)
(2.15736e-21 -1.80631e-21 5.51366e-22)
(0 0 0)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
99
(
(0 0 0)
(-1.5045e-22 0 0)
(1.994e-22 0 -2.1326e-29)
(-2.22897e-24 0 2.13252e-29)
(-4.03616e-23 0 -4.26492e-29)
(4.2519e-23 0 7.25019e-28)
(-6.55867e-23 0 0)
(-1.92563e-23 0 -1.06616e-29)
...
)
;
    }
}


// ************************************************************************* //
