tests/test_case/periodic_hills/system/sampleDict2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type	sets;
libs ("libsampling.so");
// Set output format : choice of
//      xmgr
//      jplot
//      gnuplot
//      raw
//      vtk
//      csv
setFormat csv;


interpolationScheme cellPoint;

// Fields to sample.
fields
(
    U
);



writeControl    timeStep;
writeInterval   200;


sets
(
    lineuh_0.05
    {
        type    lineFace;
        axis    y;
        start   (0.05 3.035 0);
        end     (0.05 0 0);
        nPoints 100;
    }
    lineuh_0.5
    {
        type    lineFace;
        axis    y;
        start   (0.5 3.035 0);
        end     (0.5 0 0);
        nPoints 100;
    }
    lineuh_1
    {
        type    lineFace;
        axis    y;
        start   (1 3.035 0);
        end     (1 0 0);
        nPoints 100;
    }
    lineuh_2
    {
        type    lineFace;
        axis    y;
        start   (2 3.035 0);
        end     (2 0 0);
        nPoints 100;
    }
    lineuh_3
    {
        type    lineFace;
        axis    y;
        start   (3 3.035 0);
        end     (3 0 0);
        nPoints 100;
    }
    lineuh_4
    {
        type    lineFace;
        axis    y;
        start   (4 3.035 0);
        end     (4 0 0);
        nPoints 100;
    }
    lineuh_5
    {
        type    lineFace;
        axis    y;
        start   (5 3.035 0);
        end     (5 0 0);
        nPoints 100;
    }
    lineuh_6
    {
        type    lineFace;
        axis    y;
        start   (6 3.035 0);
        end     (6 0 0);
        nPoints 100;
    }
    lineuh_7
    {
        type    lineFace;
        axis    y;
        start   (7 3.035 0);
        end     (7 0 0);
        nPoints 100;
    }
    lineuh_8
    {
        type    lineFace;
        axis    y;
        start   (8 3.035 0);
        end     (8 0 0);
        nPoints 100;
    }

);


// *********************************************************************** //
