tests/test_case/periodic_hills/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*| =========            >| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
    |  \    /   O peration     | Version:  1.7.1                                 |
    |   \  /    A nd           | Web:      www.OpenFOAM.com                      |
    |    \/     M anipulation  |                                                 |
    \*---------------------------------------------------------------------------*/
    FoamFile
    {
    	version     2.0;
    	format      ascii;
    	class       dictionary;
    	location    "system";
    	object      setFieldsDict;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    defaultFieldValues ( volScalarFieldValue cellFields 0 );

    regions
    (
          boxToCell
          {
               box ( -100 0 -10 ) (4 1 10) ;
               fieldValues ( volScalarFieldValue cellFields 1);
          }

    );


    // ************************************************************************* //
